[{"ward":"1","first name":"Brent","last name":"Cromley","website":"","facebook":"https://www.facebook.com/CromleyforCouncil?pnref=story","twitter":"https://twitter.com/brcromley","phone number":"252-3512 (h), 248-7731 (w)","email address":"cromleybillings@gmail.com","why":"Let’s continue exciting projects begun in Ward 1: Community Innovations, EBIRD, Inner Belt Loop, making downtown Billings more vibrant.","work to limit city expansion boundaries?":"Yes","work to limit city expansion boundaries?--moreinfo":"This is essential to promote planned development without further taxing existing residents. During my first term on the Council, this has been a top priority of mine in land use decisions.","pass a fully inclusive non discrimination ordinance?":"Yes","pass a fully inclusive non discrimination ordinance?--moreinfo":"Besides being an issue of human rights, this is also needed in order for our City to compete with other cities in attracting businesses and functions which are now bypassing us in favor of more welcome venues.","expand jail diversification programs - i.e. drug treatment court?":"Yes","expand jail diversification programs - i.e. drug treatment court?--moreinfo":"We should cooperate with the County in these programs. We also need to encourage funding for the expanded treatment services and facilities that are necessary to a successful diversification program.","expand the multi-use trail and bike lanes?":"Yes","expand the multi-use trail and bike lanes?--moreinfo":"These amenities will make the City more attractive and desirable to current and future residents, and promote healthy lifestyles.  Billings has been somewhat late to realize the benefit of  these facilities and therefore needs to address methods of eliminating certain obstacles and situations that hinder a complete bike and trail system.","name":"Brent Cromley","photo":"/images/counselors/Cromley.Brent.jpg"},{"ward":"1","first name":"Kerri","last name":"Seekins-Crowe","website":"http://www.kerriforcouncil.com/?fb_ref=Default","facebook":"https://www.facebook.com/KerriforCouncil15","twitter":"","phone number":"245-0430 (h), 208-6587 (w)","email address":"kerricrowe66@gmail.com","why":"City Council's focus needs to be rebuilding trust, finding smart solutions for safety and services, implementing fiscal responsibility, and aiding the economic growth of the city.","work to limit city expansion boundaries?":"Yes","work to limit city expansion boundaries?--moreinfo":"Growth is great if it's done right. Sprawl is costing residents and the city in ways that a good plan would have prevented.","pass a fully inclusive non discrimination ordinance?":"No","pass a fully inclusive non discrimination ordinance?--moreinfo":"For any entity that contracts with the city, the City Council should remove any policies that discriminate in the following areas: -- Housing, City Employment, City Contracting, Boards and Commissions, and Federal Title VI City. Beyond that, the City Council is not the right place to determine discrimination laws. The state and federal levels are where those difficult decisions need to take place.Programs and Services","expand jail diversification programs - i.e. drug treatment court?":"No","expand jail diversification programs - i.e. drug treatment court?--moreinfo":"It is an expensive program that keeps low-risk offenders unnecessarily sitting in jail -- and that expense is passed onto the taxpayers. Diversion program -- yes. If it is implemented wisely, recidivism goes down, the cost is much less, and the offender takes on most of the financial responsibility -- not the taxpayer.","expand the multi-use trail and bike lanes?":"No","expand the multi-use trail and bike lanes?--moreinfo":"I am glad that there is a phenomenal trail system in the Heights. I, and 100s of others, use it daily. However, bike paths and trails need to be constructed in a responsible manner that adds to the beauty of this city -- not creates congestion.","name":"Kerri Seekins-Crowe","photo":"/images/counselors/Seekinscrowe.Kerri.jpg"},{"ward":"1","first name":"Angie","last name":"Buckley","website":"http://www.buckleyforbillings.net/","facebook":"https://www.facebook.com/buckleyforabetterbillings?pnref=story","twitter":"","phone number":"672-9998","email address":"angie.buckley7406@gmail.com","why":"My priorities are lead the city through structured, smart growth which includes affordable housing, treatment options and expanding transportation options.","work to limit city expansion boundaries?":"Yes","work to limit city expansion boundaries?--moreinfo":"The City Council has no authority over the development that is going on outside of city limits. However, the city can implement a smart annexation plan that ensures that the taxpayers get a return on their investment. It's vital that appropriate impact fees are assessed so that tax payers do not bear the financial burden.","pass a fully inclusive non discrimination ordinance?":"Yes","pass a fully inclusive non discrimination ordinance?--moreinfo":"Let's be proud to live in a city that doesn't discriminate against ANYONE","expand jail diversification programs - i.e. drug treatment court?":"Yes","expand jail diversification programs - i.e. drug treatment court?--moreinfo":"","expand the multi-use trail and bike lanes?":"Yes","expand the multi-use trail and bike lanes?--moreinfo":"","name":"Angie Buckley","photo":"/images/counselors/Buckley.Angie.jpg"},{"ward":"2","first name":"Larry","last name":"Brewster","website":"","facebook":"","twitter":"","phone number":"670-0929","email address":"larry05@bresnan.net","why":"keep costs down, responsible development, good transportation, better parks. lower water rates, finish inner belt loop.","work to limit city expansion boundaries?":"No","work to limit city expansion boundaries?--moreinfo":"If there is property adjacent to the boundary and the developer pay's for improvements, it's better than low density development.","pass a fully inclusive non discrimination ordinance?":"No","pass a fully inclusive non discrimination ordinance?--moreinfo":"Depends on the ordinance, I support the principal if it protects a persons right to exercise conscience.","expand jail diversification programs - i.e. drug treatment court?":"Yes","expand jail diversification programs - i.e. drug treatment court?--moreinfo":"I'm all for that, better on probation than jail.","expand the multi-use trail and bike lanes?":"Yes","expand the multi-use trail and bike lanes?--moreinfo":"I especially like them in commute corridors, another motivation to ride.","name":"Larry Brewster","photo":"/images/counselors/Brewster.Larry.jpg"},{"ward":"2","first name":"Chris","last name":"Purcell","website":"","facebook":"","twitter":"https://twitter.com/cjschroeder1","phone number":"259-4986","email address":"crystaljunepurcell@gmail.com","why":"Fiscal Responsibility, Developmental Planning, Environmental Issues, and representation of all #HeightsResidents on BCC.#VotePurcell","work to limit city expansion boundaries?":"Yes","work to limit city expansion boundaries?--moreinfo":"There are definitely concerns over what could happen if there is unlimited expansion. The City of Billings must have the ability to provide municipal services to those areas that are annexed without creating an unnecessary financial or resource burden for those areas already within the city limits. Billings is expected to increase about 40,000 in population over the next 20 years. That’s with a 1.5 increase in population. Where that population will locate is important and careful planning to accommodate growth is important. Studies show that the millennials and baby boomers are the age groups for whom the city will need to provide services in the future. At the same time, it will be necessary to consider how we can continue to be a community that is attractive and thriving so as to cause young individuals and young families to be attracted to Billings. Undeveloped areas in the midst of us can be unattractive and an eyesore! We need to look to development of infill areas to the greatest extent possible for the benefit of all.","pass a fully inclusive non discrimination ordinance?":"Yes","pass a fully inclusive non discrimination ordinance?--moreinfo":"Of course we should pass a fully inclusive non-discrimination ordinance. How can we possibly claim to care about our City and its’ people when we know that discrimination exists, that individuals are hurt by that discrimination, yet we do nothing to stop it. I find it hard to believe that anyone wants a friend they care about or a family member to be discriminated against. Pass it.","expand jail diversification programs - i.e. drug treatment court?":"Yes","expand jail diversification programs - i.e. drug treatment court?--moreinfo":"Expanding jail diversification programs would be a good thing. The American Medical Association determined alcohol addiction to be a disease in 1956. Many people with addictions (drug and alcohol) require treatment of one kind or another in order to remain drug and alcohol free. There are those professionals who believe that methamphetamine is a harder addiction to break and that in-patient treatment is a must for some individuals in order for them to be successful. Most certainly, Drug Treatment Courts have been successful, in good part because those involved with Drug Treatment Courts know that they are being monitored, and that there is available to them a strong support system to help them remain drug and/or alcohol free. Helping people remain drug free is a far cheaper way to deal with the issue of addicted people than incarceration. People who are drug/alcohol free can become contributing members of society.","expand the multi-use trail and bike lanes?":"Yes","expand the multi-use trail and bike lanes?--moreinfo":"Multi-use trails and bike lanes seem to be a very popular thing and I would think that wherever possible, expansion of those would be a good thing. At the time streets are being painted for traffic needs, it makes sense that if there is adequate space for bike lanes that the addition of those could naturally occur and would require little money to do so. Multi-use trails and bike lanes are used by a wide variety of different people and wherever they can be added and there is adequate funding to do so, it makes sense.","name":"Chris Purcell","photo":"/images/counselors/Purcell.Chris.jpg"},{"ward":"2","first name":"Frank","last name":"Ewalt","website":"","facebook":"","twitter":"","phone number":"245-3671","email address":"fewalt@gmail.com","why":"","work to limit city expansion boundaries?":"Maybe","work to limit city expansion boundaries?--moreinfo":"Limiting boundaries might be more involved than what is seen on the surface. With a change in tax structure Laurel and Lockwood could expand their boundaries and Billings would be left with stagnate growth potential. If you are thinking along the lines of infill areas this can also be complicated. First someone would want to sell property, then a developer would need to take the risk to develop, and then someone would want to live in the area.","pass a fully inclusive non discrimination ordinance?":"No","pass a fully inclusive non discrimination ordinance?--moreinfo":"I do not believe that the City of Billings should be passing laws for special interest groups, where do you start and stop. Passing ordinances or laws can't be taken lightly once passed they have to be enforced. A good example of a good intentioned ordinance, the cell phone ban in City limits, with failed enforcement.","expand jail diversification programs - i.e. drug treatment court?":"Unsure","expand jail diversification programs - i.e. drug treatment court?--moreinfo":"I do not know enough about this subject to comment wisely.","expand the multi-use trail and bike lanes?":"No","expand the multi-use trail and bike lanes?--moreinfo":"I really think Billings has more essential issues to work on. If trails and bike lanes are built using grant monies, the on going maintenance costs money and has to come from some where. Maybe bikers should have a license fee to help with the cost. Don't get me wrong, I think trails and bike lanes are great if resources were unlimited.","name":"Frank Ewalt","photo":"/images/counselors/Ewalt.Frank.jpg"},{"ward":"2","first name":"Walt","last name":"Donges","website":"","facebook":"https://www.facebook.com/pages/Walt-Donges-Heights-Candidate-for-City-Council/1635036553377466","twitter":"","phone number":"698-1750","email address":"wrdonges@msn.com","why":"Billings’ future: a diverse, environmentally sustainable, well planned city, attracting talent to build community & jobs paying living wages","work to limit city expansion boundaries?":"Yes","work to limit city expansion boundaries?--moreinfo":"City boundaries must be managed in regards to the needs of the city now and in 20 years. Holding city boundaries is only part of the equation, planning to meet the needs of an aging city, with diverse housing needs, and growing demands on city services need equal consideration. Infill and population density plans are crucial. All of these must be considered in conjunction with increased demands on services.","pass a fully inclusive non discrimination ordinance?":"Yes","pass a fully inclusive non discrimination ordinance?--moreinfo":"As the largest city in Montana we cannot afford to look to the past. \nBillings’ future is before us and it demands our attention. Our future is dependent upon enticing a diverse, talented work force, attractive to high tech businesses paying living wages, willing to invest in our shared future. By building a more diverse community, we attract high tech companies willing to engage the Montana work force stereotype, pay a living wage and ensure a motivated, innovative, and dedicated work force. To achieve this we must:\n-        Continue to create an environmentally green city\n-        Develop the city’s reputation as a diverse community\n-        Ensure that all who live here have a voice \n-        Implement ‘out of the box’ ideas to conserve water and reduce or delay the need for a new water processing plant\n-        Plan the city’s future foot print to include affordable housing\n-        Provide more information to the voters on all issues before them to allow for informed decisions One of Billing’s strengths is its diversity which will continue to grow, our goal should be to ensure each citizen has an equal voice at the table, feels safe in their neighborhoods and has equal access to all city services.","expand jail diversification programs - i.e. drug treatment court?":"Yes","expand jail diversification programs - i.e. drug treatment court?--moreinfo":"Recent reports show the “Spare change for real change” Serial inebriate, downtown program is working. No less than 32 individuals have taken advantage of this program since inception. Evaluating who is serviced by the jail, costs of services to outside entities and future projections are being considered. The city is making recognizable progress in these areas.","expand the multi-use trail and bike lanes?":"Yes","expand the multi-use trail and bike lanes?--moreinfo":"Already I see the new bike lanes in the Heights being utilized. Our trail system is expansive and growing. Use will only increase and will serve the future Billings resident wanting neighborhoods, with a diverse populations bringing diverse needs and businesses to serve the resident.","name":"Walt Donges","photo":"/images/counselors/Donges.Walt.jpg"},{"ward":"3","first name":"Chris","last name":"Friedel","website":"","facebook":"https://www.facebook.com/cpfriedel?fref=nf","twitter":"https://twitter.com/cpfriedel","phone number":"272-2245","email address":"chris@chrisfriedel.com","why":"","work to limit city expansion boundaries?":"","work to limit city expansion boundaries?--moreinfo":"","pass a fully inclusive non discrimination ordinance?":"","pass a fully inclusive non discrimination ordinance?--moreinfo":"","expand jail diversification programs - i.e. drug treatment court?":"","expand jail diversification programs - i.e. drug treatment court?--moreinfo":"","expand the multi-use trail and bike lanes?":"","expand the multi-use trail and bike lanes?--moreinfo":"","name":"Chris Friedel","photo":"/images/counselors/Friedel.Chris.jpg"},{"ward":"3","first name":"Kevin","last name":"Hamilton","website":"http://www.safetykevin.com/","facebook":"https://www.facebook.com/Khamilton2015/info?tab=page_info","twitter":"","phone number":"534-9453","email address":"kevin@safetykevin.com","why":"My priorities are getting the NDO passed, public safety funding, the homeless issue, and budgetary control.","work to limit city expansion boundaries?":"Yes","work to limit city expansion boundaries?--moreinfo":"","pass a fully inclusive non discrimination ordinance?":"Yes","pass a fully inclusive non discrimination ordinance?--moreinfo":"","expand jail diversification programs - i.e. drug treatment court?":"Yes","expand jail diversification programs - i.e. drug treatment court?--moreinfo":"","expand the multi-use trail and bike lanes?":"Yes","expand the multi-use trail and bike lanes?--moreinfo":"","name":"Kevin Hamilton","photo":"/images/counselors/Hamilton.Kevin.jpg"},{"ward":"3","first name":"Becky","last name":"Bird","website":"","facebook":"https://www.facebook.com/pages/Rebecca-Bird-Ward-3-Billings-City-Council-Member/233117850067375","twitter":"","phone number":"534-2523 (w), 869-3550 (w)","email address":"beckybird@bresnan.net","why":"My top priorities are to continue to focus on quality of life issues and lead an ongoing effort toward creating community that will attract and keep young people and families. Parks, public safety, jobs, smart growth, community pride. Respect for people and continuing to become more open, tolerant and inclusive. Protect our water, reduce waste, and reuse and recycle what we can.","work to limit city expansion boundaries?":"Yes","work to limit city expansion boundaries?--moreinfo":"Billings needs to hold fast to its commitment to infill, expand infrastructure in a smart and efficient manner. The city should move away from a sprawl tradition and grow in a way that enhances the city’s athletics and resources.","pass a fully inclusive non discrimination ordinance?":"Yes","pass a fully inclusive non discrimination ordinance?--moreinfo":"Without Question.","expand jail diversification programs - i.e. drug treatment court?":"Yes","expand jail diversification programs - i.e. drug treatment court?--moreinfo":"Opportunity not incarceration. Let’s drop the practice of making problems worse and ultimately more expensive.","expand the multi-use trail and bike lanes?":"Yes","expand the multi-use trail and bike lanes?--moreinfo":"There should be full and inclusive connectivity throughout Billings when the system is complete.","name":"Becky Bird","photo":"/images/counselors/Bird.Becky.jpg"},{"ward":"4","first name":"Ryan","last name":"Sullivan","website":"http://www.sullivanforbillings.com/","facebook":"https://www.facebook.com/sullivanforbillingscitycouncil","twitter":"","phone number":"850-0165 (h), 869-8707","email address":"sullivan.ryan@gmail.com","why":"Build public trust in government, make public safety a priority, and ensure taxpayers feel they are getting value from their tax dollars.","work to limit city expansion boundaries?":"No","work to limit city expansion boundaries?--moreinfo":"The City Council cannot control subdivision growth outside the city limits. However, it is important that if subdivisions are annexed into the city, the subdivisions must pay appropriate impact fees that ensure the taxpayers of Billings aren’t footing the bill for infrastructure. Appropriate impact fees for annexation naturally make infill areas cost competitive for redevelopment, which, in turn, helps increase the tax base without expanding the service area.","pass a fully inclusive non discrimination ordinance?":"No","pass a fully inclusive non discrimination ordinance?--moreinfo":"I believe that the State and Federal governments are best suited to legislate and execute discrimination laws. A local NDO adds to the patchwork LGBT laws throughout the state and country and provides limited remedies to employment and housing discrimination.","expand jail diversification programs - i.e. drug treatment court?":"Yes","expand jail diversification programs - i.e. drug treatment court?--moreinfo":"I support programs that keep low-risk offenders out of jail and keep them as productive members of society. Diversion programs must be cost effective and cost-competitive.","expand the multi-use trail and bike lanes?":"Yes","expand the multi-use trail and bike lanes?--moreinfo":"It's important to have recreation options in the city. The city council must ensure that current and future trails and bike lanes are properly placed, planned, maintained, and are affordable over the life of the asset.","name":"Ryan Sullivan","photo":"/images/counselors/Sullivan.Ryan.jpg"},{"ward":"4","first name":"Bill","last name":"Brown","website":"","facebook":"","twitter":"","phone number":"208-0354","email address":"billbrown4ward4@gmail.com","why":"I'm for managed growth & wise use of taxpayer money # Bill","work to limit city expansion boundaries?":"Yes","work to limit city expansion boundaries?--moreinfo":"I support the current city policy that limits annexation to areas that can be served by existing city infrastructure.","pass a fully inclusive non discrimination ordinance?":"Yes","pass a fully inclusive non discrimination ordinance?--moreinfo":"","expand jail diversification programs - i.e. drug treatment court?":"Yes","expand jail diversification programs - i.e. drug treatment court?--moreinfo":"Expanding alternatives to simply locking people up is more effective and less expensive. I would like to see this expanded.","expand the multi-use trail and bike lanes?":"Yes","expand the multi-use trail and bike lanes?--moreinfo":"Billings needs better alternatives to driving. I support trails and bike lanes as well as improved bus service and neighborhood shopping.","name":"Bill Brown","photo":"/images/counselors/Brown.Bill.jpg"},{"ward":"4","first name":"Francis","last name":"DeVries","website":"","facebook":"","twitter":"","phone number":"534-8345 (h), 696-4406 (c)","email address":"frankdevries2013@gmail.com","why":"First item on my agenda is to work to make our city safe people must feel safe in their homes and around their neighborhood","work to limit city expansion boundaries?":"","work to limit city expansion boundaries?--moreinfo":"This issue has no easy answer I will work with local groups to balance the need for housing and infrastructure","pass a fully inclusive non discrimination ordinance?":"No","pass a fully inclusive non discrimination ordinance?--moreinfo":"Passing an NDO will have to be the will of the people and I will not block or hinder any ordinance. I do think Billings has aressed this already","expand jail diversification programs - i.e. drug treatment court?":"Yes","expand jail diversification programs - i.e. drug treatment court?--moreinfo":"I do believe that the efforts of the courts have paid off for everyone I will continue to support the drug treatment courts call me back.","expand the multi-use trail and bike lanes?":"Yes","expand the multi-use trail and bike lanes?--moreinfo":"I truly believe we need to continue and expand the use of multi use trails and bike lanes along with more public education and awareness.","name":"Francis DeVries","photo":"/images/counselors/Devries.Francis.jpg"},{"ward":"4","first name":"Nathan","last name":"Schmitz","website":"http://www.schmitzforbillings.com/","facebook":"https://www.facebook.com/pages/Nathan-Schmitz-for-Billings-City-Council-Ward-4/1634925376743170","twitter":"","phone number":"670-6484","email address":"nathan@schmitzforbillings.com","why":"Billings needs safety, economic growth, fiscal responsibility, and transparency.I’m dedicated to this community and committed to progress.","work to limit city expansion boundaries?":"Yes","work to limit city expansion boundaries?--moreinfo":"Billings should work to limit the amount of sprawl. Expanding our boundaries via annexation increases the associated cost of delivery of city services to these areas. While growth will continue in Billings, it needs to be sustainable and efficient and not be an excessive burden to taxpayers.","pass a fully inclusive non discrimination ordinance?":"Yes","pass a fully inclusive non discrimination ordinance?--moreinfo":"Discrimination in any form is unacceptable for our city.","expand jail diversification programs - i.e. drug treatment court?":"Yes","expand jail diversification programs - i.e. drug treatment court?--moreinfo":"We should continue to expand jail diversification programs in Billings. Drug court is a great example that has tremendous results. This will require that we continue to be open minded to new alternatives that can help to alleviate the burden on our jail and also serve those who are in need of assistance.","expand the multi-use trail and bike lanes?":"Yes","expand the multi-use trail and bike lanes?--moreinfo":"We should continue to expand bike lanes and trails. The citizen survey clearly demonstrated that this is an important and valuable asset to our city. As the trail have expanded, there has been an increase in use.","name":"Nathan Schmitz","photo":"/images/counselors/Schmitz.Nathan.jpg"},{"ward":"5","first name":"Richard \"Dick\"","last name":"Clark","website":"","facebook":"","twitter":"","phone number":"656-1086 (h), 698-5839 (w)","email address":"twodc@bresnan.net","why":"","work to limit city expansion boundaries?":"Yes","work to limit city expansion boundaries?--moreinfo":"","pass a fully inclusive non discrimination ordinance?":"No","pass a fully inclusive non discrimination ordinance?--moreinfo":"","expand jail diversification programs - i.e. drug treatment court?":"","expand jail diversification programs - i.e. drug treatment court?--moreinfo":"","expand the multi-use trail and bike lanes?":"","expand the multi-use trail and bike lanes?--moreinfo":"","name":"Richard \"Dick\" Clark","photo":"/images/counselors/Clark.Richarddick.jpg"},{"ward":"5","first name":"Dennis","last name":"Ulvestad","website":"","facebook":"","twitter":"","phone number":"651-1736 (h), 656-9500 (w)","email address":"uden621@aol.com","why":"My top priority we should limit city expansion boundaries to prevent sprawl","work to limit city expansion boundaries?":"Yes","work to limit city expansion boundaries?--moreinfo":"","pass a fully inclusive non discrimination ordinance?":"Yes","pass a fully inclusive non discrimination ordinance?--moreinfo":"","expand jail diversification programs - i.e. drug treatment court?":"Yes","expand jail diversification programs - i.e. drug treatment court?--moreinfo":"","expand the multi-use trail and bike lanes?":"Yes","expand the multi-use trail and bike lanes?--moreinfo":"It should be with the careful growth of the city.","name":"Dennis Ulvestad","photo":"/images/counselors/Ulvestad.Dennis.jpg"},{"ward":"5","first name":"Ken","last name":"Crouch","website":"","facebook":"","twitter":"","phone number":"534-2616 (h)","email address":"revken1961@gmail.com","why":"","work to limit city expansion boundaries?":"Yes","work to limit city expansion boundaries?--moreinfo":"","pass a fully inclusive non discrimination ordinance?":"Yes","pass a fully inclusive non discrimination ordinance?--moreinfo":"","expand jail diversification programs - i.e. drug treatment court?":"Yes","expand jail diversification programs - i.e. drug treatment court?--moreinfo":"","expand the multi-use trail and bike lanes?":"Yes","expand the multi-use trail and bike lanes?--moreinfo":"","name":"Ken Crouch","photo":"/images/counselors/Crouch.Ken.jpg"}]